shitposter/XML_requests/request_templ.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <Action soapenv:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">
            http://ifx.ru/IFX3WebService/IIFXService/OpenSession
        </Action>
    </soapenv:Header>
    <soapenv:Body>
        <osmreq xmlns="http://ifx.ru/IFXWebService">
            <mbci>client_type</mbci>
            <mbcv>1.0</mbcv>
            <mbh>OnluHeadline</mbh>
            <mbi>lipkerton</mbi>
            <mbla>ru-RU</mbla>
            <mbo>OS Name</mbo>
            <mbp>password</mbp>
            <mbt></mbt>
        </osmreq>
    </soapenv:Body>
</soapenv:Envelope>